{"meta":{"title":"ThereisntJack!","subtitle":"","description":"","author":"Jack2007Q","url":"http://thereisntJack.github.io","root":"/"},"pages":[{"title":"about","date":"2021-08-13T01:08:49.000Z","updated":"2021-08-13T02:44:13.072Z","comments":false,"path":"about/index.html","permalink":"http://thereisntjack.github.io/about/index.html","excerpt":"","text":"神的圣殿 与&nbsp; Jack&nbsp; （ 真（ま）白（しろ） ） 对话中... bot_ui_ini()"},{"title":"留言板","date":"2020-07-26T12:17:58.000Z","updated":"2020-07-27T11:03:22.579Z","comments":true,"path":"comment/index.html","permalink":"http://thereisntjack.github.io/comment/index.html","excerpt":"","text":"来发言啊~"},{"title":"分类","date":"2020-07-26T16:00:00.000Z","updated":"2020-07-27T11:26:33.557Z","comments":false,"path":"categories/index.html","permalink":"http://thereisntjack.github.io/categories/index.html","excerpt":"","text":""},{"title":"donate","date":"2020-07-31T02:03:59.000Z","updated":"2020-07-31T02:04:45.458Z","comments":true,"path":"donate/index.html","permalink":"http://thereisntjack.github.io/donate/index.html","excerpt":"","text":""},{"title":"links","date":"2020-07-27T11:34:31.000Z","updated":"2021-08-13T03:02:15.633Z","comments":true,"path":"links/index.html","permalink":"http://thereisntjack.github.io/links/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-02-13T12:24:16.000Z","updated":"2020-07-26T02:40:12.840Z","comments":false,"path":"tags/index.html","permalink":"http://thereisntjack.github.io/tags/index.html","excerpt":"","text":""},{"title":"theme-sakura","date":"2021-08-13T02:48:23.000Z","updated":"2021-08-13T03:00:28.090Z","comments":true,"path":"theme-sakura/index.html","permalink":"http://thereisntjack.github.io/theme-sakura/index.html","excerpt":"","text":"​ 我现在使用的主题是 SakuraPlus 是一位大佬在sakura的基础上魔改的版本，使用的很顺手，而作者在我搭建博客的时候也给予了我很多帮助，因此在这里表达一下对作者的感谢。 传送门： SakuraPlus传送门2： Sakura大佬的示例站：https://cungudafa.js.org/小破站预览视频：bilibili"}],"posts":[{"title":"回顾","slug":"回顾","date":"2021-08-10T00:49:01.000Z","updated":"2021-08-14T08:29:49.054Z","comments":true,"path":"2021/08/10/回顾/","link":"","permalink":"http://thereisntjack.github.io/2021/08/10/%E5%9B%9E%E9%A1%BE/","excerpt":"","text":"​ 时光飞逝，如白马过隙，不舍昼夜。转眼间，一年已经蹑手蹑脚的在我们身边悄然经过。偶得良机，趁着这短暂的闲暇时光，对我这一年做一个小小的总结。 ​ 从去年8月中旬开始，我就不可救药的迷上了彩六，在九月份开学后，我依然没有因此而停止，反而变本加厉。这对于我学习的影响是毋庸置疑的，因为它，我荒废了学业，在期中考试只考了全班第九。随着期末考试的临近，我也尝试给我制定计划表，规划每一天的作息，但是全都没有认真遵守。期末考试，我至今都不知道考了第几，也许相较于期中有所进步，但对于我来说没有什么区别，一个学期就这样结束了。 ​ 我很快的投入了吃喝玩乐之中，回老家，整天蜗居在宅子里，和弟弟，和表哥玩玩游戏，有时候兴致来了再帮亲戚们去山上捡捡鸡蛋，遛遛狗，放放鞭炮，钓钓鱼，我陶醉于山清水秀的景色中，沉浸在悠闲自在的生活中，完全对下一学期没有任何思考和顾虑。因为学校需要14天的健康证明，我们便提前回京。在这开学的最后14天里，我还没有从假期中收心，网课也没有认真上，最终在一顿训斥之后，我的气焰才稍微得到收敛，心思才逐渐回到学习上来。 ​ 在得知了会有开学考之后，开始复习，重点定在数学，生物，地理三科上（其实数学是因为上一学期我没有好好学）。之后便是开学考试，也许是因为我数学的超长发挥，也许是同学们还没有准备好，总而言之，考了一个还不错的成绩。之后，因为某些原因，我突然有了一个明确的目标（甚至自己都没有意识到)，并且不知不觉的开始为之努力，说实话，我甚至都没有感觉到自己和以往有什么变化，但是事实是我的排名的确进步了，期中考试虽然我的排名相较于开学考有些回落，但我知道那是我自己真正的实力，而不是开学考数学发挥提的分。同时，在这期间，我也感受到了成绩的提升带来的其他改变。我在与另外几名同学的竞选中成功成为共青团员，其实我本来根本没有抱任何希望，因为一方面竞选者是我挺好的朋友，另一方面我也知道自己的选票根本不会超过他，再者到时候自己的选票比别人低一大截岂不是很尴尬？但是在老师的 怂恿 劝导下我还是参加了，然后就奇迹般的当选了。我至今都不知道为什么会当选，但我的的确确沉醉于同学们的掌声中，而我和他的友谊相信也不会因此而改变。随后我们都进入了紧张的生地中考备战当中，每天都很晚才回到家。6月27号很快就到了，当初百日时感觉远在天边的事情一下便近在眼前。现在想想，我考试发挥的只能说是中规中矩，还稍微有些失常。不过这一切都是过去式了。在这之后，我们都立刻投入期末考试的复习之中。而我，因为一个进入前三的约定，还算努力的复习，最终进入前三，但是约定却还没有实现 : &lt; 之后我们学校组织去了趟欢乐谷，看了次电影，讲讲破试卷，评评优，一个学期就又结束了。 ​ 学期结束后，我去了趟青海，看看青海湖，吸一吸氧，随后便参加了我妈给我报的封闭式课程中，一周才回一次家。每天课表就是上课下课吃饭上课下课睡觉，整整4周。在开始时我听到这个消息时是奔溃的（现在也是），但是在上了几天课后我开始get used to it.在那里，认为我收获最大的是数学和物理，数学老师不知为何有我们自己的教材（我觉得老师可能是人系的）随后便开始以迅雷不及掩耳之势讲起来，第一天就留了5页的数学练习册（我们平时周末也才留4页啊）。不管怎样，虽然我对一些地方的应用题还是没有什么思路（万恶的三角函数！！！）,最终还是讲完了整个初三的数学知识。而物理则是把电讲完了，而我居然认为自己还能解大部分练习题了！（谁给你的自信）同时，我也认识了很多新朋友，有校内的，当然最多的还是校外的。 ​ 既然今天有时间，我来感谢一些人吧。 ​ 有些话因为之前说的太多了，就简短的说吧 ​ 爸爸，感谢您一直原谅我所犯的错误，一直支持我。另外，那个 约定 是不是应该…… : - &gt; ​ 妈妈，感谢您一直监督我，给我报这一个夏令营，让我收获颇丰。 ​ 弟弟：谢谢你，即使在我一次次欺骗你，捉弄你的情况下，依然相信我，按照我说的去做。 ​ 接下来的人名我不会写出，不过可以猜猜是不是你 ​ 某位同学：谢谢你，自从认识，你就十分热情，从初二上学期一块买手办，到初二下一块玩密室逃脱。即使当初我在团员竞选中胜出，你依然没有因此而疏远我，在欢乐谷时邀请我去玩极速飞车，即使那时我没有玩，你依然放弃排好的队伍和我们一起去玩其他项目。你像是我们中的老大哥（本来你就最大），如果我没有记错的话，至今你的朋友圈背景都是你，我和楼下三个人看着纷飞的落叶的图片。 ​ 某位同学：谢谢你，我在开学时第一天第一个认识的就是你，你阳光开朗，同时热情，一下就把我从小学的阴霾中拽出，迎接全新的初中生活，初一时我沉默寡言，和班级中的其他同学基本上没有什么交流，是你拓展了我的社交圈，让我得以认识更多同学，让我也变得更加开朗。你总是乐呵呵的，我几乎没有见过你生气过，我都不忍心捉弄你，我个人认为你是我们几个性格中最完美的一个。 ​ 某位同学：谢谢你，我和你认识相较于别人不算早，但性格十分合得来，所以十分熟识，你在我看来几乎没有什么缺点，我玩过你手机上的俄罗斯方块，也和你一块去过密室逃脱，在看到一些发笑的场面时你总会说“太逗了”。同时你体育也很好，我见过你打棒球的照片，样子简直帅呆了。 ​ 某位同学：谢谢你，你初一时高不可攀，但通过楼上我还是认识到了你。其实开始我对你的印象不是特别好，但在我向你要卷子时，你说没有的同时还说了一句“对不起”让我受宠若惊。通过密室我们的友谊进一步加深，虽然你也有一些缺点，我也曾狠狠的怼过你，但对我来说你依然是一个优秀的人。 ​ 某位同学：谢谢你，初一我就与你熟识，我们聊天聊地，聊泰拉瑞亚，聊彩虹六号，在聊天时我总喜欢绕着操场散步，其实，我在微信上和你说的话最多。你数学很好，但是在开始从没有因此而歧视我，你总喜欢夸自己，天天听你夸自己搞得我现在都要被你同化了，在彩六上和你联机总是我的快乐源泉。 ​ 某位同学：谢谢你，从初一开始我就觉得你的性格好，到了初二，我才发现你实则高情商，全班人都能和你聊的来，在我考得不好的时候你也会安慰我，在初二下有几个星期我因为一些原因没怎么和你和楼下说话，但之后肯定不会了。 ​ 某位同学：谢谢你，我和你直到初二下才熟识，在这之前我对你的印象只停留在暴躁上，但在认识之后才发现确实是这样。你虽然有时候会嘲讽我，捉弄我，但我也一样，我们依然关系很好。ps：期末气死我了，为什么你期末常规文写想象文分居然比我还高？？？？有天理吗？？？我本来分比你高的！！！ ​ 某位同学：谢谢你，在这学期开始时让我找到了一个目标，一个前进的方向。在这之前，你似乎遥不可及，但开学之后，你给我指明了一条道路，中间有过许多波折。不管之后怎样，谢谢你成为我前进的动力。 ​ 感谢所有教导过我的老师们，感谢你们对我的谆谆教诲，让我收益颇丰。 ​ 感谢所有相处过的同学，感谢你们带领我走向正确的道路。 ​ 还有许多人因为时间原因在这里没有一一列举，在这里统一表达对你们的感谢。 ​ 一不小心好像说的有点多，罢了罢了，就当是我灵光一现的随记吧。","categories":[],"tags":[{"name":"往事随风","slug":"往事随风","permalink":"http://thereisntjack.github.io/tags/%E5%BE%80%E4%BA%8B%E9%9A%8F%E9%A3%8E/"}]},{"title":"先康这个","slug":"先康这个","date":"2020-07-25T06:20:39.000Z","updated":"2021-07-31T23:34:50.656Z","comments":true,"path":"2020/07/25/先康这个/","link":"","permalink":"http://thereisntjack.github.io/2020/07/25/%E5%85%88%E5%BA%B7%E8%BF%99%E4%B8%AA/","excerpt":"","text":"hello这是我的个人博客，随缘更新哦 ~不要期待~~ 博客概况​ 这个博客主要涉及计算机科学、学习笔记等方面。​ 如上面所说，不定时更新，有灵感就更新。另外，我是C++党，所以你所见到的代码几乎都是C++的，按熟悉度从上到下排序我所会的编程语言是： Scratch C++ Python 3 vbs swift php 关于我​ 在写这篇blog的时候，我正在踏上成为初二生的旅途，前面说了，更新随缘，一般情况下网站都不会关，如果你也想搭建一个hexo博客，可以自己百度，当然如果有什么疑问也可以来问我，下面是我的联系方式（优先级从上到下） b站账户 别问我为什么等级辣么低 邮箱（优先级同上）： 18010402208@qq.com Jack2007Q@outlook.com 其实从这里往下我基本就是小半年一登录了，极力不推荐 Jack2007Q@gmail.com Jack2007Q@163.com Jack135Q@163.com 洛谷账户 别看我个人空间 知乎账号 github 微博 为什么我名字是 Jack2007Q首先，从小我的英文名就是Jack and rose 后来在一天我注册穿越火线账户，他让我起一个名字，因为我出生年份是2007年，就想起Jack2007，但是发现这个名称被占用了，于是就把我的姓的拼音的第一个字加了进去，就变成 Jack2007Q 了。 一个小广告​ 我自己的公众号：乐科学编程 ，有些文章应该也会放在上面，欢迎关注 博客的由来​ 在2019年的9月的一天傍晚，我刚刚成为某市的一名初中生，我在无聊的闲逛洛谷时，忽然发现了一个人的博客，我点了进去，里面琳琅满目（我也不知道我这个词用得对不对）的文章让我赶到非常惊讶，更令我震惊的是他居然也才刚刚上初一！怀着想追求酷的心情，我点开了他的私信，询问了他是怎么建网站的，因为我之前曾经尝试过自己建站，最终钱花了，网站还没建好，在我的询问之下，他告诉我，他使用hexo进行建站的，我甚至现在都有当时私信的截图 ​ 听了他的话，我立刻上网寻找资料，用当时仅有的2017年的mbp制作了博客，但是熟悉我的人都知道，我的兴趣真的是随着风来，随着风去，建完blog，就什么都不想做了(就是懒)，于是我就把他冷落在一边。 ​ 直到最近，我忽然又想起了博客这件事，这时我的电脑已经换成了戴尔的G3了戴尔牛逼，刚好放假回老家没什么事情做，于是就又折腾起来了，在windows系统上搭建hexo可比在mac上好多了，这事只花了我一个下午，就把博客搭好了，就是因为项目是托管在github上面的，所以访问的速度会比较慢，请谅解。 友联​ 如果您希望在此推广您的博客，或希望与鄙人交个朋友，我们可以互加友链，相互交流学习。可以通过上面的方式联系我，也可以在下方评论。这段其实是抄友链第一个人的 友链要求： ​ 能够访问就行了 CZQ-King https://2005czq.github.io/ 厚颜无耻，明明对面都不知道就加了 温馨提示​ 1、其实这一整篇文章都是 抄 借鉴 CZQ-King 的一篇文章的 包括这个 ，而这个人也在上文被我反复提到过 ​ 2、如果您的浏览器显示不了公式、图片或排版有问题的，请尝试更换(更新) Chrome 浏览器。 ​ 3、如果您发现文章有误，可以联系我，也可以在文章下面的评论区 虽然现在还没有 指正，谢谢！ 大事祭​ 2020/7/23 ： 我出生辣 ​ 2020/7/25 ： 发布了第一篇文章（就是这篇） ​ 2020/7/26： 主题更换为hexo-theme-sakuraplus","categories":[],"tags":[{"name":"简介","slug":"简介","permalink":"http://thereisntjack.github.io/tags/%E7%AE%80%E4%BB%8B/"}]}],"categories":[],"tags":[{"name":"往事随风","slug":"往事随风","permalink":"http://thereisntjack.github.io/tags/%E5%BE%80%E4%BA%8B%E9%9A%8F%E9%A3%8E/"},{"name":"简介","slug":"简介","permalink":"http://thereisntjack.github.io/tags/%E7%AE%80%E4%BB%8B/"}]}